frontend-capstone/artillerytest.yaml
config:
  target: http://localhost:3000
  phases:
    - duration: 10
      arrivalRate: 30
      name: Warm up
    - duration: 10
      arrivalRate: 30
      name: Ramp it up
scenarios:
  - flow:
      - loop:
          - get:
              url: "/products/{{ $randomNumber(1, 1000000) }}"
        count: 5